# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# Install essential tools
brew "ansifilter"
brew "bat"
brew "coreutils"
brew "git"
brew "git-delta"
brew "glibc" if OS.linux?
brew "gpg" if OS.mac?
brew "openssl@1.1"
brew "ripgrep"
brew "shellcheck"                   # needed before shellcheck vscode extn
brew "starship"                     # current shell prompt
brew "wget"
brew "yamllint"
brew "zopfli"
# Diagram scripting
tap "terrastruct/d2"
brew "d2"


# Install essential casks (GUI applications)
cask "aldente"
cask "colour-contrast-analyser"
# cask "daisydisk"                  # checksum undefined
cask "firefox"
cask "google-drive"
cask "handbrake"
cask "imageoptim"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "kap"
cask "keepassxc", greedy: true      # always upgrade
# cask "little-snitch"
# cask logi-options-plus     # iff 3S is on the desk
cask "monitorcontrol"
# mas "nextdns", id: 1464122853
# Nikon Webcam Utility https://downloadcenter.nikonimglib.com/en/download/sw/209.html
cask "pika"
cask "protonvpn"
cask "raspberry-pi-imager"
cask "screaming-frog-seo-spider"
cask "screens-connect"
# mas "sequel-ace", id: 1518036000
cask "shottr"
# cask "spotify"                    # checksum undefined
# mas "unifi", id: 1057750338
cask "visual-studio-code"
cask "zoom"


# Install font cask for nerd-fonts and such
# Font preview: https://www.programmingfonts.org/#source-code-pro
tap "homebrew/cask-fonts"
cask "font-source-code-pro-for-powerline"
# cask "font-fira-code-nerd-font"
# cask "font-hack-nerd-font"
cask "font-atkinson-hyperlegible"
# cask "font-ia-writer-duospace"    # checksum undefined
# cask "font-ia-writer-mono"        # checksum undefined
cask "font-ibm-plex"
cask "font-inter"
# cask "font-lato"                  # checksum undefined
# cask "font-nunito"                # checksum undefined
# cask "font-nunito-sans"           # checksum undefined


# Docker daemon should be running for this.
# It should be running if this Brewfile is run from `setup.sh`.
brew "whalebrew"

# Install linux packages through Whalebrew
# https://github.com/whalebrew/whalebrew
# whalebrew "whalebrew/ffmpeg"


# Install VSCode extensions
# generic extensions
vscode "yzhang.markdown-all-in-one"
vscode "DavidAnson.vscode-markdownlint"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "timonwong.shellcheck"

# python specific extensions
vscode "ms-python.python"
vscode "njpwerner.autodocstring"
vscode "KevinRose.vsc-python-indent"
vscode "donjayamanne.python-environment-manager"

# containerising
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
