# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# All taps
tap "buo/cask-upgrade"              # `brew cu` for cask updates
tap "microsoft/git"
tap "homebrew/cask-fonts"
tap "terrastruct/d2"
tap "danopia/tools"                 # https://github.com/dalance/amber/issues/46#issuecomment-756813259
tap "spicetify/homebrew-tap"        # spicetify

# Install essential tools
brew "amber"                        # tap danopia
brew "ansifilter"
brew "bandwhich"                    # current network utilisation by proc
brew "bat"                          # rust port - cat; highlight, git
brew "bottom"                       # rust port - htop; process monitor
brew "broot"                        # rust port - tree; truncated output
brew "coreutils"
brew "exa"                          # rust port: ls
brew "fd"
brew "findutils"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-filter-repo"              # clean way to rewrite git history
brew "glibc" if OS.linux?
brew "gnupg"
brew "gpg" if OS.mac?
brew "gping"
brew "helix"
brew "hexyl"
# brew "imagemagick"
brew "kondo"
# brew "lynx"
brew "moreutils"
brew "nvim"                         # neovim
brew "openssh"
brew "openssl@1.1"
brew "paperkey"
brew "pinentry-mac"
brew "procs"
brew "pv"
# brew "rename"
brew "ripgrep"
brew "rustscan"
brew "sccache"
brew "sd"
brew "shellcheck"                   # needed before shellcheck vscode extn
brew "spicetify-cli"                # customise spotify
brew "ssh-copy-id"
brew "starship"                     # current shell prompt
brew "tldr"
brew "tokei"
# brew "valgrind"                   # noinstall: not available for Apple Silicon
brew "vbindiff"
brew "wget"
brew "xh"                           # rust port - curl; HTTPie API
brew "yamllint"
brew "zellij"                       # rust port - tmux; floating panes
brew "zopfli"
brew "zoxide"
# Diagram scripting
brew "d2"                           # tap terrastruct


# Install essential casks
cask "aldente"
cask "colour-contrast-analyser"
# cask "daisydisk"                  # noinstall: checksum undefined
cask "firefox"
cask "git-credential-manager"
cask "google-drive"
cask "handbrake"
cask "imageoptim"
cask "inkscape"
cask "iterm2"
cask "karabiner-elements"
cask "kap"
cask "keepassxc", greedy: true      # always upgrade
# cask "little-snitch"
# cask "logi-options-plus"          # iff 3S is on the desk
cask "logseq"
cask "magicavoxel"                  # 8-bit 3D voxel editor and renderer
cask "monitorcontrol"
# mas "nextdns", id: 1464122853
# Nikon Webcam Utility https://downloadcenter.nikonimglib.com/en/download/sw/209.html
cask "pika"
cask "protonvpn"
cask "raspberry-pi-imager"
cask "screaming-frog-seo-spider"
cask "screens-connect"
# mas "sequel-ace", id: 1518036000
cask "shottr"
# cask "spotify"                    # noinstall: checksum undefined
# mas "unifi", id: 1057750338
cask "visual-studio-code"
cask "zoom"


# Install fonts (tap cask-fonts)
# Font preview: https://www.programmingfonts.org/#source-code-pro
cask "font-source-code-pro-for-powerline"
# cask "font-fira-code-nerd-font"
# cask "font-hack-nerd-font"
cask "font-atkinson-hyperlegible"
# cask "font-ia-writer-duospace"    # noinstall: checksum undefined
# cask "font-ia-writer-mono"        # noinstall: checksum undefined
cask "font-ibm-plex"
cask "font-inter"
# cask "font-lato"                  # noinstall: checksum undefined
# cask "font-nunito"                # noinstall: checksum undefined
# cask "font-nunito-sans"           # noinstall: checksum undefined


# # Install some CTF tools; see https://github.com/ctfs/write-ups.
# brew "aircrack-ng"
# brew "bfg"
# brew "binutils"
# brew "binwalk"
# brew "cifer"
# brew "dex2jar"
# brew "dns2tcp"
# brew "fcrackzip"
# brew "foremost"
# brew "hashpump"
# brew "hydra"
# brew "john"
# brew "knock"
# brew "netpbm"
# brew "nmap"
# brew "pngcheck"
# brew "socat"
# brew "sqlmap"
# brew "tcpflow"
# brew "tcpreplay"
# brew "tcptrace"
# brew "ucspi-tcp" # `tcpserver` etc.
# brew "xpdf"
# brew "xz"


# Docker daemon should be running for this.
# It should be running if this Brewfile is run from `setup.sh`.
brew "whalebrew"

# Install linux packages through Whalebrew
# https://github.com/whalebrew/whalebrew
# whalebrew "whalebrew/ffmpeg"


# Install VSCode extensions

# Generic
vscode "DavidAnson.vscode-markdownlint"              # md linting and stylechecking
# vscode "MS-vsliveshare.vsliveshare"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "adpyke.codesnap"                             # code screenshots
vscode "christian-kohler.path-intellisense"          # autocomplete filenames
vscode "streetsidesoftware.code-spell-checker"       # helpful for latex
vscode "timonwong.shellcheck"
vscode "vscodevim.vim"                               # vim keybindings in vscode (note: enable keyrepeat (check macos.sh for VSCode settings))
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"                  # preview, shortcuts, ToC for writing md

# Themes & Icons
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "Equinusocio.vsc-material-theme"
vscode "GulajavaMinistudio.mayukaithemevsc"
vscode "Nimda.deepdark-material"
vscode "PKief.material-icon-theme"
vscode "alexdauenhauer.catppuccin-noctis"            # catppuccin colour + noctis highlighting
vscode "dnicolson.binary-plist"                      # opens new editor with xml and writes to binary plist on the fly
vscode "dracula-theme.theme-dracula"
vscode "ftsamoyed.theme-pink-cat-boo"
vscode "liviuschera.noctis"
vscode "ryanolsonx.solarized"
vscode "teabyii.ayu"
# vscode "webrender.synthwave-x-fluoromachine"       # true synthwave, needs custom css; goes with Operator Mono

# C/C++
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "twxs.cmake"


# Python
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"                    # py lsp
vscode "njpwerner.autodocstring"
vscode "KevinRose.vsc-python-indent"
vscode "donjayamanne.python-environment-manager"

# Containerised
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"          # dev containers
